app/controllers/hero_schedules_controller.rb

  def index
    start_clause = params[:start_date].present? ? "scheduled_on >= '#{params[:start_date]}'" : nil
    end_clause = params[:end_date].present? ? "scheduled_on <= '#{params[:end_date]}'" : nil
    hero_schedules = HeroSchedule.where(start_clause).where(end_clause).all
---
SELECT "hero_schedules".* FROM "hero_schedules" WHERE "hero_schedules"."hero_id" = $1  [["hero_id", 1]]

  def create
    hero_schedule = HeroSchedule.new(hero_schedule_params)

    if hero_schedule.save
---
INSERT INTO "hero_schedules" ("scheduled_on", "hero_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["scheduled_on", "2015-10-12"], ["hero_id", 1], ["created_at", "2015-09-02 21:39:35.792799"], ["updated_at", "2015-09-02 21:39:35.792799"]]

  def update
    if @hero_schedule.update(hero_schedule_params)
---
UPDATE "hero_schedules" SET "scheduled_on" = $1, "hero_id" = $2, "updated_at" = $3 WHERE "hero_schedules"."id" = $4  [["scheduled_on", "2015-09-10"], ["hero_id", 1], ["updated_at", "2015-09-03 16:52:58.621152"], ["id", 1]]