app/controllers/heroes_controller.rb

SELECT "hero_schedules".* FROM "hero_schedules" WHERE "hero_schedules"."hero_id" = $1  [["hero_id", 4]]
---
  def show
    if params[:id].downcase == 'today'
      @hero = HeroSchedule.today
    else
      @hero = Hero.find(params[:id])