app/controllers/hero_preferences_controller.rb

  def index
    @hero_preferences = HeroPreference.all
---
SELECT "hero_preferences".* FROM "hero_preferences"

  def create
    @hero_preference = HeroPreference.new(hero_preference_params)

    if @hero_preference.save
---
INSERT INTO "hero_preferences" ("hero_id", "can_schedule", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["hero_id", 2], ["can_schedule", "f"], ["notes", "Please do not schedule me this day."], ["created_at", "2015-09-03 20:42:55.191896"], ["updated_at", "2015-09-03 20:42:55.191896"]]

  def update
    if @hero_preference.update(hero_preference_params)
---
UPDATE "hero_preferences" SET "can_schedule" = $1, "notes" = $2, "updated_at" = $3 WHERE "hero_preferences"."id" = $4  [["can_schedule", "t"], ["notes", "Never mind, I can work after all."], ["updated_at", "2015-09-03 20:44:51.996772"], ["id", 11]]