app/controllers/holidays_controller.rb

INSERT INTO "holidays" ("holiday_date", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    holiday = Holiday.new(holiday_params)

    if holiday.save